Revit 2024 API
BuiltInFailures.GeometryFailures.SiteInvisible Property
 Topographic elements are not visible in your current view. You can modify View Range settings in the view's Properties or Visibility settings in Visibility/Graphics.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SiteInvisible { get; }
Visual Basic
Public Shared ReadOnly Property SiteInvisible As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SiteInvisible {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace